** Error reporting

By default ~shell~ prints output messages to stdout:

#+BEGIN_SRC nim :exports both :results scalar
import shell

shell:
  ls
#+END_SRC

#+RESULTS:
: shellCmd: ls
: shell> nim.cfg
: shell> README.org
: shell> shell
: shell> shell.nim
: shell> shell.nim.bin
: shell> shell.nimble
: shell> tests

What is printed to stdout can be configured by using defines:

- ~shellNoDebugOutput~ :: Do not print command output
- ~shellNoDebugError~ :: Do not print error output
- ~shellNoDebugCommand~ :: Do not print command being executed
- ~shellNoDebugRuntime~ :: When error occurs do not print failed command

By default these are disabled - to enable use either
~-d:shellNoDebug*~ or use the ~{.define(shellNoDebug*).}~ pragma

#+BEGIN_SRC nim :exports both :results scalar
{.define(shellNoDebugOutput).}

import shell

shell:
  ls
#+END_SRC

#+RESULTS:
: shellCmd: ls

The default ~shellVerbose~ command combines stderr and stdout into
single result. To get =stdout=, =stderr= and the return code
separately use ~shellVerboseErr~. Both of these templates have an
overload that takes ~set[DebugOutputKind]~ to control printing
settings:

#+BEGIN_SRC nim :exports both :results scalar
import shell

let (res, err, code) = shellVerboseErr {dokCommand}:
  echo "test"

echo "Returned string: '", res, "' with exit code ", code

#+END_SRC

#+RESULTS:
: shellCmd: echo test
: Returned string: 'test' with exit code 0

Printing errors directly into stdout is good solution for most of the
use cases, but sometimes it is necessary to provide more sophisticated
error handing - throwing an exception when the command failed. To
switch to exceptions use ~-d:shellThrowException~. It will
automatically disable all other output types in the default
configuration.

#+begin_src nim :exports both :results scalar
{.define(shellThrowException).}

import shell, strutils

try:
  shell:
    ls -l
    ls -z
except ShellExecError:
  let e = cast[ShellExecError](getCurrentException())
  echo e.msg # Error message describing what happened
  echo "command was: ", e.cmd # Original command string
  assert e.cmd == "ls -z"
  echo "return code: ", e.retcode # Return code
  echo "regular out: ", e.outstr # Stdout from command
  echo "error outpt: "
  for l in e.errstr.split('\n'): # Stderr from the command
    echo "  ", l
#+end_src

#+RESULTS:
: Command ls -z exited with non-zero code
: command was: ls -z
: return code: 2
: regular out:
: error outpt:
:   ls: invalid option -- 'z'
:   Try 'ls --help' for more information.

On command failure ~ShellExecError~ is raised.

Note that some commands output error messages into ~stdout~ rather
than into ~stderr~ - it might be necessary to check both. In this
particular example content of the ~stderr~ is largely meaningless:
actual reason for error was printed into ~stdout~.

#+begin_src nim :exports both :results scalar
{.define(shellThrowException).}

import shell, strutils

try:
  shell:
    ngspice -b "/tmp/ngpsice-simulation/zzz.netkRs8jE"
except ShellExecError:
  let e = cast[ShellExecError](getCurrentException())
  echo e.msg # Error message describing what happened
  echo "command was: ", e.cmd # Original command string
  echo "exec direct: ", e.cwd # 
  echo "return code: ", e.retcode # Return code
  echo "regular out: \n====\n", e.outstr # Stdout from command
  echo "====\nerror outpt: \n====\n", e.errstr # Stderr from the command
#+end_src

#+RESULTS:
#+begin_example
Command ngspice -b /tmp/ngpsice-simulation/zzz.netkRs8jE exited with non-zero code
command was: ngspice -b /tmp/ngpsice-simulation/zzz.netkRs8jE
exec direct: /home/test/workspace/git-sandbox/shell
return code: 1
regular out: 
====

====
error outpt: 
====
/tmp/ngpsice-simulation/zzz.netkRs8jE: No such file or directory
#+end_example
